<a href="https://colab.research.google.com/github/kgpark88/data-analysis/blob/main/02_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 판다스(Pandas) 데이터프레임(DataFrame)
행과 열을 가지는 자료구조로 인덱스(index),  열(columns), 값(values)으로 구성된다.
DataFrame은 동일한 인덱스를 공유하기 위해 함께 모인 일련의 Series 객체로 생각할 수 있다.

In [1]:
import pandas as pd

In [2]:
columns= ['name', 'gender', 'age', 'internet', 'mobile'] 
index= ['c1', 'c2', 'c3', 'c4', 'c5']
data = [['박민준',  'M',  '30', 20000, 52000],
    ['강서연',  'F',  '25', 30000, 43000],
    ['이서준',  'M',  '30', 35000, 35000],
    ['서지우',  'F',  '30', 25000, 65000],
    ['최준서',  'M',  '30', 28000, 25000]]

In [3]:
data

[['박민준', 'M', '30', 20000, 52000],
 ['강서연', 'F', '25', 30000, 43000],
 ['이서준', 'M', '30', 35000, 35000],
 ['서지우', 'F', '30', 25000, 65000],
 ['최준서', 'M', '30', 28000, 25000]]

## 데이터프레임 만들기

In [4]:
df = pd.DataFrame(data,index,columns)

In [5]:
df

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c3  이서준      M  30     35000   35000
c4  서지우      F  30     25000   65000
c5  최준서      M  30     28000   25000

# 데이터 선택(Selection and Indexing)


# COLUMNS(열)

## 단일 column 선택

In [6]:
df['name']

c1    박민준
c2    강서연
c3    이서준
c4    서지우
c5    최준서
Name: name, dtype: object

## 여러개의 columns 선택

In [7]:
# Pass a list of column names
df[['name','age']]

   name age
c1  박민준  30
c2  강서연  25
c3  이서준  30
c4  서지우  30
c5  최준서  30

### Columns은 Series 이다.

In [8]:
type(df['name'])

pandas.core.series.Series

### 새로운 column 만들기

In [9]:
df['total'] = df['internet'] + df['mobile']

In [10]:
df

   name gender age  internet  mobile  total
c1  박민준      M  30     20000   52000  72000
c2  강서연      F  25     30000   43000  73000
c3  이서준      M  30     35000   35000  70000
c4  서지우      F  30     25000   65000  90000
c5  최준서      M  30     28000   25000  53000

## column 제거

In [11]:
# axis=1 : column 선택
df.drop('total',axis=1)

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c3  이서준      M  30     35000   35000
c4  서지우      F  30     25000   65000
c5  최준서      M  30     28000   25000

In [12]:
# 다시 할당(assigne)하지 않으면 저장되지 않는다.

In [13]:
df = df.drop('total',axis=1)

In [14]:
df

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c3  이서준      M  30     35000   35000
c4  서지우      F  30     25000   65000
c5  최준서      M  30     28000   25000

## Row(행) 다루기

## name으로 단일 row 선택

In [15]:
df.loc['c1']

name          박민준
gender          M
age            30
internet    20000
mobile      52000
Name: c1, dtype: object

## name으로 여러개의 row 선택

In [16]:
df.loc[['c2','c5']]

   name gender age  internet  mobile
c2  강서연      F  25     30000   43000
c5  최준서      M  30     28000   25000

## index 번호로 단일 row 선택

In [17]:
df.iloc[0]

name          박민준
gender          M
age            30
internet    20000
mobile      52000
Name: c1, dtype: object

## index 번호로 여러개의 row 선택

In [18]:
df.iloc[0:3]

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c3  이서준      M  30     35000   35000

## name으로 row 제거

In [19]:
df.drop('c3',axis=0)

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c4  서지우      F  30     25000   65000
c5  최준서      M  30     28000   25000

In [20]:
# NOT IN PLACE!
df

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c3  이서준      M  30     35000   35000
c4  서지우      F  30     25000   65000
c5  최준서      M  30     28000   25000

### 서브셋 선택

In [21]:
df.loc[['c1','c4'],['name','gender']]

   name gender
c1  박민준      M
c4  서지우      F

# 조건부 선택(Conditional Selection)

In [22]:
df

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c3  이서준      M  30     35000   35000
c4  서지우      F  30     25000   65000
c5  최준서      M  30     28000   25000

In [23]:
df['mobile'] > 50000

c1     True
c2    False
c3    False
c4     True
c5    False
Name: mobile, dtype: bool

In [24]:
df[df['mobile'] > 50000]

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c4  서지우      F  30     25000   65000

In [25]:
df[df['mobile'] > 50000]['name']

c1    박민준
c4    서지우
Name: name, dtype: object

In [26]:
df[df['mobile'] > 50000][['name','mobile']]

   name  mobile
c1  박민준   52000
c4  서지우   65000

조건 결합 ( | : OR,  & : AND )

In [27]:
df[(df['internet'] > 20000) & (df['mobile'] > 50000)]

   name gender age  internet  mobile
c4  서지우      F  30     25000   65000

## Index 세부 내용

In [28]:
df

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c3  이서준      M  30     35000   35000
c4  서지우      F  30     25000   65000
c5  최준서      M  30     28000   25000

인덱스 리셋

In [29]:
df.reset_index()

  index name gender age  internet  mobile
0    c1  박민준      M  30     20000   52000
1    c2  강서연      F  25     30000   43000
2    c3  이서준      M  30     35000   35000
3    c4  서지우      F  30     25000   65000
4    c5  최준서      M  30     28000   25000

In [30]:
df

   name gender age  internet  mobile
c1  박민준      M  30     20000   52000
c2  강서연      F  25     30000   43000
c3  이서준      M  30     35000   35000
c4  서지우      F  30     25000   65000
c5  최준서      M  30     28000   25000

## DataFrame Summary 정보
### <tt><strong>df.describe()</strong></tt> : numerical column 의 통계 정보 제공
### <tt><strong>df.info, df.dtypes</strong></tt> : 모든 column의 데이터 타입 표시

In [31]:
df.describe()

           internet        mobile
count      5.000000      5.000000
mean   27600.000000  44000.000000
std     5594.640292  15394.804318
min    20000.000000  25000.000000
25%    25000.000000  35000.000000
50%    28000.000000  43000.000000
75%    30000.000000  52000.000000
max    35000.000000  65000.000000

In [32]:
df.dtypes

name        object
gender      object
age         object
internet     int64
mobile       int64
dtype: object

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, c1 to c5
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5 non-null      object
 1   gender    5 non-null      object
 2   age       5 non-null      object
 3   internet  5 non-null      int64
 4   mobile    5 non-null      int64
dtypes: int64(2), object(3)
memory usage: 400.0+ bytes

## 파일에서 데이터 로드

In [34]:
# df = pd.read_csv('churn_data.csv')
df = pd.read_csv('https://raw.githubusercontent.com/kgpark88/ai-summary/main/churn_data.csv')

In [35]:
df

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.5,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,6840-RESVB,Male,0,Yes,Yes,24,Yes,Yes,DSL,Yes,...,Yes,Yes,Yes,Yes,One year,Yes,Mailed check,84.80,1990.5,No
7039,2234-XADUH,Female,0,Yes,Yes,72,Yes,Yes,Fiber optic,No,...,Yes,No,Yes,Yes,One year,Yes,Credit card (automatic),103.20,7362.9,No
7040,4801-JZAZL,Female,0,Yes,Yes,11,No,No phone service,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.60,346.45,No
7041,8361-LTMKD,Male,1,Yes,No,4,Yes,Yes,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Mailed check,74.40,306.6,Yes
7042,3186-AJIEK,Male,0,No,No,66,Yes,No,Fiber optic,Yes,...,Yes,Yes,Yes,Yes,Two year,Yes,Bank transfer (automatic),105.65,6844.5,No

## 데이터 결합(Union)

In [36]:
# df1 = pd.read_csv('churn_data.csv')
# df2 = pd.read_csv('churn_data.csv')
df1 = pd.read_csv('https://raw.githubusercontent.com/kgpark88/ai-summary/main/churn_data.csv')
df2 = pd.read_csv('https://raw.githubusercontent.com/kgpark88/ai-summary/main/churn_data.csv')
df = pd.concat([df1, df2], ignore_index=True)

In [37]:
df

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.5,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14081,6840-RESVB,Male,0,Yes,Yes,24,Yes,Yes,DSL,Yes,...,Yes,Yes,Yes,Yes,One year,Yes,Mailed check,84.80,1990.5,No
14082,2234-XADUH,Female,0,Yes,Yes,72,Yes,Yes,Fiber optic,No,...,Yes,No,Yes,Yes,One year,Yes,Credit card (automatic),103.20,7362.9,No
14083,4801-JZAZL,Female,0,Yes,Yes,11,No,No phone service,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.60,346.45,No
14084,8361-LTMKD,Male,1,Yes,No,4,Yes,Yes,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Mailed check,74.40,306.6,Yes
14085,3186-AJIEK,Male,0,No,No,66,Yes,No,Fiber optic,Yes,...,Yes,Yes,Yes,Yes,Two year,Yes,Bank transfer (automatic),105.65,6844.5,No